diagrams/diagrams.md
```mermaid
classDiagram
  class UdpServer
  class UdpClient
  class UdpSocket
  class MetricsHttpServer
  class Stats
  UdpServer --> UdpSocket
  UdpClient --> UdpSocket
  UdpServer --> Stats
  UdpClient --> Stats
  UdpServer --> MetricsHttpServer
```
